АлогистикТест2/src/Documents/алк_УпаковкаНоменклатуры/алк_УпаковкаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УпаковкаНоменклатуры</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыИсторияЗаказов</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_РасформированиеПакетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаЗапасов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПродукции</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаЗапасов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПродукции</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.алк_ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияНоменклатурыПЭО</name>
      <type>
        <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
      </type>
    </attributes>
    <attributes>
      <name>Припуск</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомераПродукция</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПродукцияПФ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_НаправленияДеятельности/алк_НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_НаправленияДеятельности</name>
  <enumValues>
    <name>ДревесныеГранулы</name>
  </enumValues>
  <enumValues>
    <name>Лесопиление</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
  <enumValues>
    <name>МалоеЛесопиление</name>
  </enumValues>
  <enumValues>
    <name>Шпон</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_УпаковкаНоменклатуры/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПодборПроизведен" 
		И ЗначениеЗаполнено(Параметр) 
		//Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		//АдресЗапасовВХранилище	= Параметр;
		//
		//Если МаркерПодбора = "Продукция" Тогда
		//	
		//	ИмяТабличнойЧасти = "Продукция";
		//	
		//ИначеЕсли МаркерПодбора = "Запасы" Тогда
		//	
		//	ИмяТабличнойЧасти = "Запасы";
		//	
		//ИначеЕсли МаркерПодбора = "Отходы" Тогда
		//	
		//	ИмяТабличнойЧасти = "Отходы";
		//	
		//КонецЕсли;
		//
		//ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, Истина, Истина);
		
	ИначеЕсли ИмяСобытия = "ПодборСерий"
		И ЗначениеЗаполнено(Параметр) 
		//Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		//Если Элементы.Страницы.ТекущаяСтраница = Элементы.ТЧПродукция Тогда
		//	ПолучитьСерийныеНомераПродукцииИзХранилища(Параметр.АдресВоВременномХранилище, Параметр.КлючСтроки);
		//Иначе
		//	ПолучитьСерийныеНомераЗапасыИзХранилища(Параметр.АдресВоВременномХранилище, Параметр.КлючСтроки);
		//КонецЕсли;
		
		ПолучитьСерийныеНомераПродукцииИзХранилища(Параметр.АдресВоВременномХранилище, Параметр.КлючСтроки);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти 


#Область СобытияЭлементовФормы

////////////////////////////// Таблица формы "Продукция" //////////////////////////////

&НаКлиенте
Процедура ПродукцияПередУдалением(Элемент, Отказ)
	
	// Серийные номера
	Для каждого ВыделеннаяСтрока Из Элементы.Продукция.ВыделенныеСтроки Цикл
		ТекущиеДанныеСтроки = Элементы.Продукция.ДанныеСтроки(ВыделеннаяСтрока);
		РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомераПродукция, ТекущиеДанныеСтроки,,ИспользоватьСерийныеНомераОстатки);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		Элемент.ТекущиеДанные.КлючСвязи = 0;
		Элемент.ТекущиеДанные.СерийныеНомера = "";
	КонецЕсли;	
	
	Если Элемент.ТекущийЭлемент.Имя = "ПродукцияСерийныеНомера" Тогда
		ОткрытьПодборСерийныеНомера("Продукция","СерийныеНомераПродукция");
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти


#Область РаботаССерийнымиНомерами

&НаКлиенте
Процедура ОткрытьПодборСерийныеНомера(ИмяТЧЗапасы, ИмяТЧСерийныеНомера)
	
	ТекущиеДанныеИдентификатор = Элементы[ИмяТЧЗапасы].ТекущиеДанные.ПолучитьИдентификатор();
	ПараметрыСерийныхНомеров = ПараметрыПодбораСерийныхНомеров(ТекущиеДанныеИдентификатор, ИмяТЧЗапасы, ИмяТЧСерийныеНомера);
	// Для подбора СН используем поле СтруктурнаяЕдиницаЗапасов
	ПараметрыСерийныхНомеров.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиницаЗапасов);
	ПараметрыСерийныхНомеров.Вставить("Ячейка", Объект.ЯчейкаЗапасов);
	ОткрытьФорму("Обработка.ПодборСерийныхНомеров.Форма", ПараметрыСерийныхНомеров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСерийныеНомераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерийныеНомера("Продукция","СерийныеНомераПродукция");
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПодбораСерийныхНомеров(ТекущиеДанныеИдентификатор, ИмяТЧ, ИмяТЧСерийныеНомера)
	
	
	Если ИмяТЧ = "Продукция" Тогда
		РежимПодбора = Истина;
	Иначе
		РежимПодбора = Ложь;
	КонецЕсли;
	
	Возврат РаботаСФормойДокумента.ПараметрыПодбораСерийныхНомеров(Объект, ЭтотОбъект.УникальныйИдентификатор, ТекущиеДанныеИдентификатор, РежимПодбора, ИмяТЧ, ИмяТЧСерийныеНомера);
	
КонецФункции

&НаСервере
Функция ПолучитьСерийныеНомераЗапасыИзХранилища(АдресВоВременномХранилище, КлючСтроки)
	
	ПараметрыИменаПолей = Новый Структура;
	ПараметрыИменаПолей.Вставить("ИмяТЧЗапасы", "Запасы");
	ПараметрыИменаПолей.Вставить("ИмяТЧСерийныеНомера", "СерийныеНомера");
	
	Возврат РаботаСФормойДокумента.ПолучитьСерийныеНомераИзХранилища(Объект, АдресВоВременномХранилище, КлючСтроки, ПараметрыИменаПолей);
	
КонецФункции

&НаСервере
Функция ПолучитьСерийныеНомераПродукцииИзХранилища(АдресВоВременномХранилище, КлючСтроки)
	
	ПараметрыИменаПолей = Новый Структура;
	ПараметрыИменаПолей.Вставить("ИмяТЧЗапасы", "Продукция");
	ПараметрыИменаПолей.Вставить("ИмяТЧСерийныеНомера", "СерийныеНомераПродукция");
	
	Возврат РаботаСФормойДокумента.ПолучитьСерийныеНомераИзХранилища(Объект, АдресВоВременномХранилище, КлючСтроки, ПараметрыИменаПолей);
	
КонецФункции


#КонецОбласти


#Область ОбработчикиКомманд

&НаСервере
Процедура ЗаполнитьПФНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	табПродукция.Номенклатура,
	|	табПродукция.КлючСвязи,
	|	табПродукция.Характеристика,
	|	табПродукция.Количество
	|ПОМЕСТИТЬ втПродукция
	|ИЗ
	|	&табПродукция КАК табПродукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СерииПродукция.СерийныйНомер,
	|	СерииПродукция.КлючСвязи
	|ПОМЕСТИТЬ втСерииПродукция
	|ИЗ
	|	&СерииПродукция КАК СерииПродукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПродукция.Номенклатура,
	|	втПродукция.Характеристика,
	|	СУММА(втПродукция.Количество) КАК Количество
	|ИЗ
	|	втПродукция КАК втПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСерииПродукция КАК втСерииПродукция
	|		ПО втПродукция.КлючСвязи = втСерииПродукция.КлючСвязи
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродукция.Номенклатура,
	|	втПродукция.Характеристика";
	
	Запрос.УстановитьПараметр("табПродукция", Объект.Продукция.Выгрузить());
	Запрос.УстановитьПараметр("СерииПродукция", Объект.СерийныеНомераПродукция.Выгрузить());

	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	Объект.ПродукцияПФ.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПФ(Команда)
	ЗаполнитьПФНаСервере();
КонецПроцедуры


// Нач мод [Пакушев И.С.] [18.05.2018] 
// Обращение № [0000000000] [ТекстЗаявки]
// Было
// Стало

&НаСервере
Функция ДобавитьСерийныйНомерСервер(Номенклатура)	
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда	
		Возврат "00";	
	КонецЕсли; 
	
	СледующийПоПорядкуНомер = ВычислитьМаксимальныйНомерИКоличество(Номенклатура)+1;
	Возврат ДобавитьСерийныйНомерПоШаблону(СледующийПоПорядкуНомер);
	
КонецФункции

&НаКлиенте
Процедура ДобавитьСерийныйНомер(Команда)
	
	Номенклатура = Элементы.Продукция.ТекущиеДанные.Номенклатура;
	
	Если ШаблонСерийногоНомера = ПредопределенноеЗначение("Справочник.ШаблоныСерийныхНомеров.ПустаяСсылка") ИЛИ Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка")    Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	НовыйНомерСтруктура = ДобавитьСерийныйНомерСервер(Номенклатура);
	
	Если НовыйНомерСтруктура = "00" Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	СсылкаСерийныйНомер = СохранитьВводСерийСервер(Номенклатура, НовыйНомерСтруктура);
	
	Если ЗначениеЗаполнено(СсылкаСерийныйНомер) Тогда
		
		
	Элементы.Продукция.ТекущиеДанные.КлючСвязи	=  Элементы.Продукция.ТекущиеДанные.НомерСтроки;
	
	Элементы.Продукция.ТекущиеДанные.СерийныеНомера	=  НовыйНомерСтруктура.НовыйНомер;
	
	СсылкаУстановлена = Ложь;
	
	Для каждого Стр Из Объект.СерийныеНомераПродукция Цикл
		
		Если Элементы.Продукция.ТекущиеДанные.КлючСвязи = Стр.КлючСвязи Тогда
			
			Стр.СерийныйНомер = СсылкаСерийныйНомер;
			СсылкаУстановлена = Истина;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Если Не СсылкаУстановлена Тогда
	
		НовСтр = Объект.СерийныеНомераПродукция.Добавить();
		
		НовСтр.КлючСвязи	=  Элементы.Продукция.ТекущиеДанные.НомерСтроки;
		НовСтр.СерийныйНомер	=  НовыйНомерСтруктура.НовыйНомер;
	
	КонецЕсли;	
	
	КонецЕсли;
	
	//Если СохраненоУспешно Тогда
	//	
	//КонецЕсли; 
	
	//УстановитьДоступностьСформироватьПакет();
	
КонецПроцедуры

&НаСервере
Функция ВычислитьМаксимальныйНомерИКоличество(Номенклатура)
	
	МаксимальныйНомерИзСправочника = Справочники.СерийныеНомера.ВычислитьМаксимальныйНомерСерии_ПоШаблону(Номенклатура, ШаблонСерийногоНомера);
	
	//Номер = Макс(МаксимальныйНомерВДокументе,МаксимальныйНомерИзСправочника);
	Номер = МаксимальныйНомерИзСправочника;
	
	Возврат Номер;
	
КонецФункции


&НаСервере
Функция ДобавитьСерийныйНомерПоШаблону(ТекущийМаксимальныйНомер)
	
	НомерЧисло = ТекущийМаксимальныйНомер;
	
	Если ЗначениеЗаполнено(ШаблонСерийногоНомера) Тогда
		//Длина цифровой части номера - не более 13 символов
		ЦифрВШаблоне = СтрЧислоВхождений(ШаблонСерийногоНомера, РаботаССерийнымиНомерамиКлиентСервер.СимволЧисла());
		ЧислоСимволовСН = Макс(ЦифрВШаблоне, СтрДлина(НомерЧисло));
		НомерСНулями = Формат(НомерЧисло, "ЧЦ="+ЦифрВШаблоне+"; ЧВН=; ЧГ=");
		
		НовыйНомерПоШаблону = "";
		НомерСимволаСН = 1;
		//Заполняем шаблон
		Для н=1 По СтрДлина(ШаблонСерийногоНомера) Цикл
			симв = Сред(ШаблонСерийногоНомера,н,1);
			Если симв=РаботаССерийнымиНомерамиКлиентСервер.СимволЧисла() Тогда
				НовыйНомерПоШаблону = НовыйНомерПоШаблону+Сред(НомерСНулями,НомерСимволаСН,1);
				НомерСимволаСН = НомерСимволаСН+1;
			Иначе
				НовыйНомерПоШаблону = НовыйНомерПоШаблону+симв;
			КонецЕсли;
		КонецЦикла;
		НовыйНомер = НовыйНомерПоШаблону;
	Иначе
		НовыйНомер = Формат(НомерЧисло, "ЧЦ=8; ЧВН=; ЧГ=");
	КонецЕсли;
	
	возврат Новый Структура("НовыйНомер, НовыйНомерЧисло", НовыйНомер, НомерЧисло);
	
	
КонецФункции // ДобавитьСерийныйНомерПоШаблону()

&НаСервере
Функция СохранитьВводСерийСервер(Номенклатура, СтруктураНомераСерии)
	
	СправочникОбъект                = Справочники.СерийныеНомера.СоздатьЭлемент();
	СправочникОбъект.Владелец		= Номенклатура;
	СправочникОбъект.Наименование	= СтруктураНомераСерии.НовыйНомер;
	
	Попытка
		СправочникОбъект.Записать();	
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Справочники.СерийныеНомера.ПустаяСсылка();
	КонецПопытки;
	
	СерийныйНомер = СправочникОбъект.Ссылка;
	НомерПакета   = СтруктураНомераСерии.НовыйНомерЧисло;
	
	Возврат СерийныйНомер;
	
КонецФункции // СохранитьВводСерийСервер()	

&НаСервере
Процедура НаправлениеПриИзмененииНаСервере()
	
	Если Объект.Направление = Перечисления.алк_НаправленияДеятельности.Лесопиление Тогда		
		Объект.СтруктурнаяЕдиницаЗапасов 	= Справочники.СтруктурныеЕдиницы.ОсновнойСклад; // СГП
		Объект.СтруктурнаяЕдиницаПродукции 	= Объект.СтруктурнаяЕдиницаЗапасов;
		Объект.ЯчейкаЗапасов = Справочники.Ячейки.НайтиПоНаименованию("Хранение переупаковки",,,Объект.СтруктурнаяЕдиницаЗапасов); 						
	КонецЕсли; 

	
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеПриИзменении(Элемент)
	НаправлениеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Элементы.Сертификат.СписокВыбора.Добавить(Справочники.СертификатыНаПродукцию.ПустаяСсылка(), "Без сертификата");

	
	Если Параметры.Ключ.Пустая() Тогда		
		Объект.СтруктурнаяЕдиницаЗапасов = Справочники.СтруктурныеЕдиницы.ОсновнойСклад; // СГП
		Объект.ЯчейкаЗапасов = Справочники.Ячейки.НайтиПоНаименованию("Хранение переупаковки",,,Объект.СтруктурнаяЕдиницаЗапасов); 						
	КонецЕсли; 
	
	УчастокПриИзмененииНаСервере();
	
КонецПроцедуры

// Кон мод [Пакушев И.С.] [18.05.2018]

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Направление <> ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.Отходы") И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение  Тогда	
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда	
			Если НЕ УпакованоСоответствуетРасформировано() Тогда
				Сообщить("Объем упаковано должен соответствовать объему расформировано");
				Отказ = Истина;	
			КонецЕсли;
		Иначе
			Сообщить("Не заполнен Документ основания");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция УпакованоСоответствуетРасформировано()
	ОснованиеОбъект = Объект.ДокументОснование.ПолучитьОбъект();
	ТаблицаРасформировано = ОснованиеОбъект.Запасы.Выгрузить(,"Номенклатура, СерийныйНомер");
	ТаблицаУпаковано = Объект.Продукция.Выгрузить(,"Номенклатура, Характеристика, Количество");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	втРасформировано.Номенклатура,
		|	втРасформировано.СерийныйНомер
		|ПОМЕСТИТЬ втРасформировано
		|ИЗ
		|	&втРасформировано КАК втРасформировано
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втУпаковано.Номенклатура,
		|	втУпаковано.Характеристика,
		|	втУпаковано.Количество КАК Количество
		|ПОМЕСТИТЬ втУпаковано
		|ИЗ
		|	&втУпаковано КАК втУпаковано
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРасформировано.Номенклатура,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав КАК Объем
		|ПОМЕСТИТЬ втПредитог
		|ИЗ
		|	втРасформировано КАК втРасформировано
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО втРасформировано.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втУпаковано.Номенклатура,
		|	втУпаковано.Характеристика,
		|	-втУпаковано.Количество
		|ИЗ
		|	втУпаковано КАК втУпаковано
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПредитог.Номенклатура,
		|	втПредитог.Характеристика,
		|	СУММА(втПредитог.Объем) КАК Объем
		|ПОМЕСТИТЬ втОбъединено
		|ИЗ
		|	втПредитог КАК втПредитог
		|
		|СГРУППИРОВАТЬ ПО
		|	втПредитог.Номенклатура,
		|	втПредитог.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОбъединено.Номенклатура,
		|	втОбъединено.Характеристика,
		|	втОбъединено.Объем
		|ИЗ
		|	втОбъединено КАК втОбъединено
		|ГДЕ
		|	втОбъединено.Объем <> 0";

	Запрос.УстановитьПараметр("втРасформировано",ТаблицаРасформировано);
	Запрос.УстановитьПараметр("втУпаковано", ТаблицаУпаковано);
	РезультатЗапроса = Запрос.Выполнить();
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();

	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Возврат Ложь;	
	Иначе	
		Возврат Истина; 
	КонецЕсли;
КонецФункции

#КонецОбласти
